package src

var FaceRank = map[string]int{
	"2": 2,
	"3": 3,
	"4": 4,
	"5": 5,
	"6": 6,
	"7": 7,
	"8": 8,
	"9": 9,
	"T": 10,
	"J": 11,
	"Q": 12,
	"K": 13,
	"A": 14,
	"X": 15,
}

var FaceName = map[int]string{
	2:  "2",
	3:  "3",
	4:  "4",
	5:  "5",
	6:  "6",
	7:  "7",
	8:  "8",
	9:  "9",
	10: "T",
	11: "J",
	12: "Q",
	13: "K",
	14: "A",
	15: "X",
}

var HandRank = map[string]int{
	"皇家同花顺": 10,
	"同花顺":   9,
	"四条":    8,
	"葫芦":    7,
	"同花":    6,
	"顺子":    5,
	"三条":    4,
	"两对":    3,
	"一对":    2,
	"高牌":    1,
}

var HandName = map[int]string{
	10: "皇家同花顺",
	9:  "同花顺",
	8:  "四条",
	7:  "葫芦",
	6:  "同花",
	5:  "顺子",
	4:  "三条",
	3:  "两对",
	2:  "一对",
	1:  "高牌",
}

var FiveHandCount = map[string]int{
	"1001": 8, //四条
	"0110": 7, //葫芦
	"2010": 4, //三条
	"1200": 3, //2对
	"3100": 2, //1对
	"5000": 1, //单牌无对
}

var ForHandCount = map[string]int{
	"0001": 8,
	"1010": 8,
	"0200": 7,
	"2100": 4,
	"4000": 1,
}
